app/views/shared/_convocation.html.erb

    <span class="data">
      <% convoker = Citizen.find_by(id_card_number: convocation.convoker_id) %>
---
SELECT  "citizens".* FROM "citizens" WHERE "citizens"."id_card_number" = ? LIMIT ?