app/views/agents/new.html.erb

<%
  stations = Station.all.map do |station|
---
SELECT "stations".* FROM "stations"