app/views/agents/show.html.erb

SELECT "archives".* FROM "archives" WHERE "archives"."agent_id" = ?
---
  num_of_flags = flags.length
  num_of_archives = Archive.where(agent_id: current_agent.id).length