app/controllers/agents_controller.rb

  def update
    # allow agent to change their profile settings

    @agent = Agent.find(params[:id])
    @agent.verification_status = true

    if current_agent.role == 'admin'
      if @agent.update_attribute('verification_status', true)
---
SELECT  "agents".* FROM "agents" WHERE "agents"."id" = ? LIMIT ?
UPDATE "agents" SET "verification_status" = ?, "updated_at" = ? WHERE "agents"."id" = ?

  def destroy
    @agent = Agent.find(params[:id])

    if current_agent.role == 'admin'
      if @agent.destroy
---
SELECT  "agents".* FROM "agents" WHERE "agents"."id" = ? LIMIT ?
DELETE FROM "agents" WHERE "agents"."id" = ?

  def archive_change(agent)
    Archive.create(archive: agent, agent_id: current_agent.id, description: "Verified the agent #{agent.id}")
---
INSERT INTO "archives" ("archive_type", "archive_id", "description", "created_at", "updated_at", "agent_id") VALUES (?, ?, ?, ?, ?, ?)