app/controllers/application_controller.rb

  def current_agent
    Agent.find(session[:agent_id]) if session[:agent_id]
---
SELECT  "agents".* FROM "agents" WHERE "agents"."id" = ? LIMIT ?