app/controllers/citizens_controller.rb

SELECT  "citizens".* FROM "citizens" WHERE "citizens"."id" = ? LIMIT ?
---
  def show
    @citizen = Citizen.find(params[:id])

SELECT  "citizens".* FROM "citizens" WHERE "citizens"."id" = ? LIMIT ?
---
  def edit
    @citizen = Citizen.find(params[:id])

SELECT  "citizens".* FROM "citizens" WHERE ("citizens"."id_card_number" = ? OR "citizens"."telephone" = ?) ORDER BY "citizens"."id" ASC LIMIT ?
---
  def search
    @query = params[:search_query].strip
    criteria = params[:search_criteria].strip

    if @query.scan(/\D/).empty?
      @citizens = Citizen.where(id_card_number: @query).or(Citizen.where(telephone: @query)).with_attached_avatar