app/controllers/sessions_controller.rb

  def create
    agent = Agent.find_by(username: params[:username])
---
SELECT  "agents".* FROM "agents" WHERE "agents"."username" = ? LIMIT ?